{
    "2024": [

    ],
    "2023": [

    ],
    "2022" : [
      {
        "title": "POWER: Program option-aware fuzzer for high bug detection ability",
        "authors": "A Lee, I Ariq, Y Kim, M Kim",
        "conference": "IEEE Conference on Software Testing, Verification and Validation (ICST)",
        "date": "2022"
      },
      {
        "title": "Citrus: Automated unit testing tool for real-world c++ programs",
        "authors": "RS Herlim, Y Kim, M Kim",
        "conference": "IEEE Conference on Software Testing, Verification and Validation (ICST)",
        "date": "2022"
      },
      {
        "title": "Learning‐based mutant reduction using fine‐grained mutation operators",
        "authors": "Y Kim, S Hong",
        "conference": "Software Testing, Verification and Reliability 32",
        "date": "2022"
      }
    ],
    "2021" : [
      {
        "title": "DEMINER: test generation for high test coverage through mutant exploration",
        "authors": "Y Kim, S Hong",
        "conference": "Software Testing, Verification and Reliability 31 (1-2), e1715",
        "date": "2021"
      },
      {
        "title": "Empirical study of effectiveness of evosuite on the sbst 2020 tool competition benchmark",
        "authors": "RS Herlim, S Hong, Y Kim, M Kim",
        "conference": "Search-Based Software Engineering: 13th International Symposium (SSBSE)",
        "date": "2021"
      },
      {
        "title": "Directed Model Checking for Fast Abstract Reachability Analysis",
        "authors": "N Lee, Y Kim, M Kim, D Ryu, J Baik",
        "conference": "IEEE Access",
        "date": "2021"
      }

    ],
    "2020" : [

    ],
    "2019" : [
      {
        "title": "MAESTRO: Automated Test Generation Framework for High Test Coverage and Reduced Human Effort in Automotive Industry",
        "authors": "Y. Kim, D. Lee, J. Baek, and M. Kim",
        "conference": "Information and Software Technology (IST)",
        "date": "2019"
      },
      {
        "title": "Precise Learn-to-Rank Fault Localization using Dynamic and Static Features of Target Programs",
        "authors": "Y. Kim, S. Mun, S. Yoo, and M. Kim",
        "conference": "ACM Transactions on Software Engineering and Methodology (TOSEM)",
        "date": "2019"
      },
      {
        "title": "Target-driven Compositional Concolic Testing with Function Summary Refinement for Effective Bug Detection",
        "authors": "Y. Kim, S. Hong and M. Kim",
        "conference": "ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE)",
        "date": "Aug 2019"
      },
      {
        "title": "Learning-based Mutant Reduction using Fine-grained Mutation Operators",
        "authors": "Y. Kim and S. Hong",
        "conference": "Software Testing, Verification & Reliability (STVR)",
        "date": "2019"
      },
      {
        "title": "DeMiner: Test Generation for High Test Coverage through Mutant Exploration",
        "authors": "Y. Kim and S. Hong",
        "conference": "Software Testing, Verification & Reliability (STVR)",
        "date": "2019"
      },
      {
        "title": "Concolic Testing for High Test Coverage and Reduced Human Effort in Automotive Industry",
        "authors": "Y. Kim, D. Lee, J. Baek, and M. Kim",
        "conference": "Intl. Conf. on Software Engineering (ICSE) Software Engineering In Practice (SEIP) track",
        "date": "May 2019"
      },
      {
        "title": "Automatic Test Case Generation through Concolic Testing to Improve SW Quality of Defense Weapon System",
        "authors": "K. Park, H. Song, J. Lee, G. Jo, Y. Kim, and M. Kim",
        "conference": "Journal of KIISE: Software and Applications, Vol. 46, No. 9",
        "date": "Nov 2019"
      }
    ],
    "2018" : [
      {
        "title": "Precise Concolic Unit Testing of C Programs with Alarm Filtering Using Symbolic Calling Contexts",
        "authors": "Y. Kim, Y. Choi, and M. Kim",
        "conference": "International Conference on Software Engineering (ICSE)",
        "date": "2018"
      },
      {
        "title": "Invasive Software Testing: Mutating Target Programs to Diversify Test Exploration for High Test Coverage",
        "authors": "Y. Kim, S. Hong, B. Ko, D. Phan, and M. Kim",
        "conference": "Mutation Workshop",
        "date": "April 2018"
      },
      {
        "title": "MUSIC: Mutation Analysis Tool with High Configurability and Extensibility",
        "authors": "L. Phan, Y. Kim, M. Kim",
        "conference": "ACM Transactions on Software Engineering and Methodology (TOSEM)",
        "date": "2018"
      },
      {
        "title": "Improving Applicability and Usability of a Concolic Testing Tool CROWN",
        "authors": "H. Kim, Y. Kim, and M. Kim",
        "conference": "Journal of KIISE: Software and Applications, Vol. 45, No. 10",
        "date": "Oct 2018"
      },
      {
        "title": "Automated Capturing and Replaying Unit Inputs of C Programs from System Executions through Static and Dynamic Analysis",
        "authors": "H. Lim, Y. Kim, and M. Kim",
        "conference": "Journal of KIISE: Software and Applications, Vol. 45, No. 10",
        "date": "Oct 2018"
      },
      {
        "title": "A Comparative Study of C Program Mutation Tools for Effective Mutation Analysis: A Case Study of Proteum and Milu",
        "authors": "Y. Kim, H. Kim, W. Yang, and M. Kim",
        "conference": "Journal of KIISE: Software and Applications, Vol. 45, No. 4",
        "date": "Apr 2018"
      },
      {
        "title": "Concolic Testing to Improve SW Quality of Defense Weapon System",
        "authors": "K. Park, J. Lee, H. Song K. Cho, Y. Kim, and M. Kim",
        "conference": "Korea Software Congress (KSC)",
        "date": "Dec 2018"
      },
      {
        "title": "AtomicitySanitizer: Effective Runtime Atomicity Violation Detector for Multithreaded C Programs",
        "authors": "S. Hong, Y. Kim, M. Kim, S. Yoon, H. Jung, and S. Park",
        "conference": "Korea Software Congress (KSC)",
        "date": "Dec 2018"
      },
      {
        "title": "Improvement of Concolic Testing Effectiveness by Supporting Bitfield Symbolic Variable",
        "authors": "A. Lee, H. Kim, Y. Kim, and M. Kim",
        "conference": " Korea Computer Congress (KCC)",
        "date": "Jun 2018"
      },
      {
        "title": " Improving Applicability and User Interface of CREST",
        "authors": "H. Kim, Y. Kim, and M. Kim",
        "conference": "Korea Conference on Software Engineering (KCSE)",
        "date": "Jan 2017"
      }
    ],
    "2017" : [
      {
        "title": "MUSEUM: Debugging Real-World Multilingual Programs Using Mutation Analysis",
        "authors": "S. Hong, T. Kwak, B. Lee, Y. Jeon, B. Ko, Y. Kim, M. Kim",
        "conference": "Information and Software Technology (IST)",
        "date": "Feb 2017"
      },
      {
        "title": "Automated Unit-test Generation for Detecting Vulnerabilities of Android Kernel Modules",
        "authors": "Y. Kim and M. Kim",
        "conference": "Journal of KIISE: Software and Applications, Vol. 44, No. 2",
        "date": "Feb 2017"
      },
      {
        "title": "Automated Capturing & Replaying Dynamic Unit Inputs of C Programs from System Executions",
        "authors": "H. Lim, Y. Kim, and M. Kim",
        "conference": "Korea Software Congress (KSC)",
        "date": "Dec 2017"
      },
      {
        "title": "COMUT: A Configurable Mutant Generation Tool for C programs for effective and efficient mutation analysis",
        "authors": "P. Loc, B. Ko, Y. Kim, and M.Kim",
        "conference": "Korea Software Congress (KSC)",
        "date": "Dec 2017"
      }
    ],
    "2016" : [
      {
        "title": "Polaris: A Framework for Efficient and Scalable Distributed Training of Large Language Models",
        "authors": "Taebum Kim, Hyoungjoo Kim, Gyeong-In Yu, Byung-Gon Chun",
        "conference": "OSDI 2022",
        "date": "July 2022"
      },
      {
        "title": "Sponge: Fast Reactive Scaling for Stream Processing with Serverless Frameworks",
        "authors": "Won Wook Song, Taegeon Um, Sameh Elnikety, Myeongjae Jeon, Byung-Gon Chun",
        "conference": "USENIX ATC 2022",
        "date": "July 2022"
      },
      {
        "title": "Mutagen4J: Effective Mutant Generation Framework for Java Programs",
        "authors": "Y. Jeon, Y. Kim, S. Hong, and M. Kim",
        "conference": "Journal of KIISE: Software and Applications, Vol. 43, No. 9",
        "date": "Sep 2016"
      },
      {
        "title": "Effective Integer Promotion Bug Detection Technique for Embedded Software",
        "authors": "Y. Kim, T. Kim, M, Kim, H. Lee, H. Jang, and M. Park",
        "conference": "Journal of KIISE: Software and Applications, Vol. 43, No. 6",
        "date": "Jun 2016"
      },
      {
        "title": "A Comparative Study of C Program Mutation Tools for Effective Mutation Analysis: A Case Study of Proteum and Milu",
        "authors": "Y. Kim, H. Kim, W. Yang, and M. Kim",
        "conference": "Winter Korea Computer Congress (KCC)",
        "date": "Dec 2016"
      },
      {
        "title": "Automated Unit-test Generation for Detecting Vulnerabilities of Android Kernel Modules",
        "authors": "Y. Kim and M. Kim",
        "conference": "Korea Computer Congress (KCC)",
        "date": "Jun 2016"
      },
      {
        "title": "Efficient Dynamic Symbolic Execution Search Strategy using Input Coverage",
        "authors": "Y. Kim and M. Kim",
        "conference": "Korea Conference on Software Engineering (KCSE)",
        "date": "Jan 2016"
      }
    ],
    "2015" : [
      {
        "title": "Directed Test Suite Augmentation: An Empirical Investigation, Journal of Software Testing",
        "authors": "Z. Xu, Y. Kim, M. Kim, M. Cohen, and G. Rothermel",
        "conference": "Verification and Reliability (STVR)",
        "date": "March 2015"
      },
      {
        "title": "Sponge: Fast Reactive Scaling for Stream Processing with Serverless Frameworks",
        "authors": "Won Wook Song, Taegeon Um, Sameh Elnikety, Myeongjae Jeon, Byung-Gon Chun",
        "conference": "USENIX ATC 2022",
        "date": "July 2022"
      },
      {
        "title": "Mutation Based Fault Localization for Real-World Multilingual Programs",
        "authors": "S. Hong, B. Lee, T. Kwak, Y. Jeon, B. Ko, Y. Kim, M. Kim",
        "conference": "IEEE/ACM International Conference on Automated Software Engineering (ASE)",
        "date": "Nov 2015"
      }
    ],
    "2014" : [
      {
        "title": " SAT-based Bounded Software Model Checking for Embedded Software: A Case Study",
        "authors": "Y. Kim and M. Kim",
        "conference": "AsiaPacific Software Engineering Conference (APSEC)",
        "date": "Dec 2014"
      },
      {
        "title": "Hybrid Directed Test Suite Augmentation: An Interleaving Framework",
        "authors": "Y. Kim, Z. Xu, M. Kim, M. Cohen, and G. Rothermel",
        "conference": "IEEE International Conference on Software Testing, Verification and Validation (ICST)",
        "date": "April 2014"
      },
      {
        "title": "Ask the Mutants: Mutating Faulty Programs for Fault Localization, IEEE International Conference on Software Testing",
        "authors": "S. Moon, Y. Kim, M. Kim, S. Yoo",
        "conference": "IEEE International Conference on Software Testing, Verification and Validation (ICST)",
        "date": "April 2014"
      },
      {
        "title": "Effective Concolic Testing using a Symbolic Library",
        "authors": "Y. Park, Y. Kim, J. Cho, and M. Kim",
        "conference": "Korea Conference on Software Engineering (KCSE)",
        "date": "Feb 2014"
      }

    ],
    "2013" : [
      {
        "title": "Automated Unit Testing of Large Industrial Embedded Software using Concolic Testing",
        "authors": "Y. Kim, Y. Kim, T. Kim, G. Lee, Y. Jang, and M. Kim",
        "conference": "IEEE/ACM Automated Software Engineering (ASE) Experience track",
        "date": "Nov 2013"
      },
      {
        "title": "FEAST: An Enhanced Fault Localization Technique using Probability of Test Cases Executing Faults",
        "authors": "S. Moon, Y. Kim, M. Kim",
        "conference": "Journal of KIISE: Software and Applications, Vol 40, No. 10",
        "date": "Oct 2013"
      },
      {
        "title": "A Comparative Case Study on Static Program Analysis Tools",
        "authors": "Y. Kim, Y. Park, M. Kim",
        "conference": "Journal of KIISE: Computing Practices and Letters, Vol. 19, No. 8",
        "date": "Aug 2013"
      },
      {
        "title": "CREST-BV: An Improved Concolic Testing Technique Supporting Bitwise Operations for Embedded Software",
        "authors": "Y. Kim, M. Kim, Y. Jang",
        "conference": "Journal of KIISE: Software and Applications, Vol. 40, No. 2",
        "date": "Feb 2013"
      },
      {
        "title" : "Improved Fault Localization Technique using Weighted Test Cases",
        "authors" : "S. Mun, Y. Kim, M. Kim",
        "conference" : "Korea Conference on Software Engineering (KCSE)",
        "date" : "Jan 2013"
      }

    ],
    "2012" : [
      {
        "title": "Concolic Testing of the Multi-sector Read Operation for Flash Storage Platform Software",
        "authors": "M. Kim, Y. Kim, and Y. Choi",
        "conference": "Formal Aspects of Computing (FACJ)",
        "date": "2012"
      },
      {
        "title": "Industrial Application of Concolic Testing Approach: A Case Study on libexif by Using CREST-BV and KLEE",
        "authors": "Y. Kim, M. Kim, Y. Kim, and Y. Jang",
        "conference": "Intl. Conf. on Software Engineering (ICSE), Software Engineering in Practice (SEIP) track",
        "date": "June 2012"
      },
      {
        "title": "A Scalable Distributed Concolic Testing Approach: An Empirical Evaluation",
        "authors": "M. Kim, Y. Kim, and G. Rothermel",
        "conference": "IEEE International Conference on Software Testing, Verification, and Validation (ICST)",
        "date": "April 2012"
      },
      {
        "title": "Industrial Application of Concolic Testing on Embedded Software: Case Studies",
        "authors": "M. Kim, Y. Kim and Y. Jang",
        "conference": "IEEE International Conference on Software Testing, Verification and Validation (ICST) Industrial track",
        "date": "April 2012"
      },
      {
        "title": "Comparison of Search Strategies of KLEE Concolic Testing Tool",
        "authors": "Y. Kim, M. Kim, Y. Kim, E. Jung",
        "conference": "Journal of KIISE: Software and Applications, Vol. 18, No.4",
        "date": "Apr 2012"
      },
      {
        "title": "A Comparative Study of Static Analysis Tools: A Case Study on libexif by Using Coverity and Sparrow",
        "authors": "Y. Park, Y. Kim, and M. Kim",
        "conference": "Korea Computer Congress (KCC)",
        "date": "Nov 2012"
      },
      {
        "title": "CREST-BV: An Improved Concolic Testing Technique with Bitwise Operations Support for Embedded Software",
        "authors": "Y. Kim, M. Kim, and Y. Jang",
        "conference": "Korea Computer Congress(KCC)",
        "date": "June 2012"
      },
      {
        "title": "A Case Study of the Application of Dynamic Symbolic Execution to RealWorld Binary Programs",
        "authors": "Duc Bui Hoang, Y. Kim, and M. Kim",
        "conference": "Korea Conference on Software Engineering (KCSE)",
        "date": "Feb 2012"
      }
    ],
    "2011" : [
      {
        "title": "A Comparative Study of Software Model Checkers as Unit Testing Tools: An Industrial Case Study",
        "authors": "M. Kim, Y. Kim, and H. Kim",
        "conference": "IEEE Transactions on Software Engineering (TSE)",
        "date": "March 2011"
      },
      {
        "title": "A Hybrid Directed Test Suite Augmentation Technique",
        "authors": "Z. Xu, Y. Kim, M. Kim and G. Rothermel",
        "conference": "IEEE Intl.Symp. on Software Reliability Engineering (ISSRE)",
        "date": "Nov 2011"
      },
      {
        "title": "Automated Analysis of Industrial Embedded Software",
        "authors": "M. Kim and Y. Kim",
        "conference": "Automated Technology for Verification and Analysis (ATVA)",
        "date": "Oct 2011"
      },
      {
        "title": "SCORE: a Scalable Concolic Testing Tool for Reliable Embedded Software",
        "authors": "Y. Kim and M. Kim",
        "conference": "ACM SIGSOFT Foundation of Software Engineering (FSE) Tool demonstration track",
        "date": "Sep 2011"
      },
      {
        "title": "Concolic Testing on Embedded Software - Case Studies on Mobile Platform Programs",
        "authors": "Y. Kim, M. Kim and Y. Jang",
        "conference": "ACM SIGSOFT Foundation of Software Engineering (FSE) Industrial track",
        "date": "Sep 2011"
      },
      {
        "title": "Case Study on Testing with KLEE Concolic Testing Tool",
        "authors": "Y. Kim, Y. Kim, and M. Kim",
        "conference": "Korea Computer Congress (KCC)",
        "date": "Nov 2011"
      },
      {
        "title": "Comparison of Test-case Generation Techniques based on Dynamic Symbolic Execution and Genetic Algorithm",
        "authors": "Y. Kim and M. Kim",
        "conference": "Korea Conference on Software Engineering (KCSE)",
        "date": "Feb 2010"
      }
    ],
    "2010" : [
      {
        "title": "Directed Test Suite Augmentation: Techniques and Tradeoffs",
        "authors": "Z. Xu, Y. Kim, M. Kim, G. Rothermel, and M. Cohen",
        "conference": "ACM SIGSOFT Foundation of Software Engineering (FSE)",
        "date": "Nov 2011"
      },
      {
        "title": "Scalable Distributed Concolic Testing: a Case Study on a Flash Storage Platform",
        "authors": "Y. Kim, M. Kim, N. Dang",
        "conference": "Grand Challenge in Verified Software Track @ Intl. Conf. on Theoretical Aspects of Computing (ICTAC) (LNCS 6255)",
        "date": "Sep 2010"
      },
      {
        "title": "Comparison of Test-case Generation Tools based on Dynamic Symbolic Execution",
        "authors": "Y. Kim and M. Kim",
        "conference": "Koea Conference on Software Engineering (KCSE)",
        "date": "Feb 2010"
      }

    ],
    "2009" : [
      {
        "title": "Concolic Testing of the Multi-sector Read Operation for Flash Memory File System",
        "authors": "M. Kim and Y. Kim",
        "conference": "Intl. Conf. on Software Engineering (ICSE), Software Engineering in Practice (SEIP) track (LNCS 5902)",
        "date": "Aug 2009"
      }
    ],
    "2008" : [
      {
        "title": "Unit Testing of Flash Memory Device Driver through a SAT-based Model Checker",
        "authors": "M. Kim, Y. Kim and H. Kim",
        "conference": "IEEE/ACM Automated Software Engineering (ASE)",
        "date": "Sep 2008"
      },
      {
        "title": "Formal Verification of a Flash Memory Device Driver - an Experience Report",
        "authors": "M. Kim, Y. Choi, Y. Kim and H. Kim",
        "conference": "Spin Workshop (LNCS 5156)",
        "date": "Aug 2008"
      },
      {
        "title": "Pre-testing Flash Device Driver through Model Checking Techniques",
        "authors": "M. Kim, Y. Kim, Y. Choi, and H. Kim",
        "conference": "IEEE Intl. Conf. on Software Testing, Verification and Validation (ICST)",
        "date": "April 2008"
      },
      {
        "title": "Formal Verification of a Flash Memory Device Driver through Model Checking",
        "authors": "M. Kim, Y. Kim, and H. Kim",
        "conference": "Korea Conference on Software Engineering (KCSE)",
        "date": "Feb 2008"
      }

    ],
    "2007" : [

    ],
    "2006" : [

    ],
    "2005" : [

    ]
  }
  